---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ContFootingCannotJoin
source: html/0d1338e3-c050-e5e1-d7a5-4dba3973481a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ContFootingCannotJoin Property

Miter plane for Wall Foundation join is too far away; Bisecting plane will be used instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContFootingCannotJoin { get; }
```